app/controllers/entries_controller.rb

INSERT INTO "entries" ("premise", "conclusion", "proof", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["premise", "premprem"], ["conclusion", "concon"], ["proof", "Le Proof Entry = Accepted"], ["created_at", "2018-03-17 21:40:29.998009"], ["updated_at", "2018-03-17 21:40:29.998009"]]
---
	def create
		@entry = Entry.new(entry_params)

		@entry.save